
. sum ahe if year==1992

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      7612    19.01087     9.19624   2.033815   76.31644

. sum ahe if year==1992

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      7612    19.01087     9.19624   2.033815   76.31644

. sum by(gender)
variable by not found
r(111);

. sum ahe by(gender)
variable by not found
r(111);

. by gender: sum ahe
variable gender not found
r(111);

. by female: sum ahe
not sorted
r(5);

. sort female

. by female: sum ahe

----------------------------------------------------------------------------------------------------------------------------------------------------
-> female = 0

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      8651    20.57906     10.5533   2.033815   91.45602

----------------------------------------------------------------------------------------------------------------------------------------------------
-> female = 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      6401    17.80898    8.873493   2.045617   72.11539


. by female: sum ahe if year==2012

----------------------------------------------------------------------------------------------------------------------------------------------------
-> female = 0

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      4283    20.90619    11.29184   2.136752   91.45602

----------------------------------------------------------------------------------------------------------------------------------------------------
-> female = 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      3157    18.29988    9.605506   2.163461   72.11539


. by female: sum ahe if year==1992

----------------------------------------------------------------------------------------------------------------------------------------------------
-> female = 0

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      4368    20.25829    9.765783   2.033815   76.31644

----------------------------------------------------------------------------------------------------------------------------------------------------
-> female = 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      3244    17.33124    8.070704   2.045617    70.8098


. by year: sum ahe
not sorted
r(5);

. sort year

. by year: sum ahe

----------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 1992

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      7612    19.01087     9.19624   2.033815   76.31644

----------------------------------------------------------------------------------------------------------------------------------------------------
-> year = 2012

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      7440    19.80026    10.68632   2.136752   91.45602


. log using "H:\log1.log"
----------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\log1.log
  log type:  text
 opened on:  14 Sep 2014, 18:06:57

. ci ahe if year==1992&bachelor==0

    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
         ahe |       4650    16.31645    .1105541        16.09971    16.53319

. ttest ahe if year==1992, by(bachelor)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    4650    16.31645    .1105541    7.538785    16.09971    16.53319
       1 |    2962     23.2408    .1826822    9.942341     22.8826    23.59899
---------+--------------------------------------------------------------------
combined |    7612    19.01087    .1054049     9.19624    18.80425    19.21749
---------+--------------------------------------------------------------------
    diff |           -6.924345    .2011091               -7.318574   -6.530115
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t = -34.4308
Ho: diff = 0                                     degrees of freedom =     7610

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. ttest ahe if year==2012, by(bachelor)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |    3485    15.68547    .1397007    8.247077    15.41157    15.95938
       1 |    3955    23.42605    .1790882    11.26264    23.07494    23.77717
---------+--------------------------------------------------------------------
combined |    7440    19.80026    .1238916    10.68632     19.5574    20.04312
---------+--------------------------------------------------------------------
    diff |            -7.74058    .2315066               -8.194399   -7.286762
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t = -33.4357
Ho: diff = 0                                     degrees of freedom =     7438

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. ci ahe if year==1992&bachelor==0

    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
         ahe |       4650    16.31645    .1105541        16.09971    16.53319

. ci ahe if year==1992&bachelor==1

    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
         ahe |       2962     23.2408    .1826822         22.8826    23.59899

. ci ahe if year==2012&bachelor==0

    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
         ahe |       3485    15.68547    .1397007        15.41157    15.95938

. ci ahe if year==2012&bachelor==1

    Variable |        Obs        Mean    Std. Err.       [95% Conf. Interval]
-------------+---------------------------------------------------------------
         ahe |       3955    23.42605    .1790882        23.07494    23.77717

. ttest ahe
by() option required
r(100);

. ttest ahe by(year)
factor variables and time-series operators not allowed
r(101);

. ttest ahe by(year)
factor variables and time-series operators not allowed
r(101);

. ttest ahe, by(year)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
    1992 |    7612    19.01087    .1054049     9.19624    18.80425    19.21749
    2012 |    7440    19.80026    .1238916    10.68632     19.5574    20.04312
---------+--------------------------------------------------------------------
combined |   15052    19.40105    .0812489    9.968151     19.2418    19.56031
---------+--------------------------------------------------------------------
    diff |           -.7893878    .1623864               -1.107685   -.4710907
------------------------------------------------------------------------------
    diff = mean(1992) - mean(2012)                                t =  -4.8612
Ho: diff = 0                                     degrees of freedom =    15050

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. ttest ahe, by(year) if bacherlors==1
option if not allowed
r(198);

. ttest ahe if bacherlors==1 by(year)
bacherlors not found
r(111);

. ttest ahe if bachelors==1 by(year)
bachelors not found
r(111);

. ttest ahe, if bachelors==1 by(year)
option if not allowed
r(198);

. ttest ahe if bachelors==1, by(year)
bachelors not found
r(111);

. ttest ahe if bachelors==1, by(year)
bachelors not found
r(111);

. ttest ahe if bachelor==1, by(year)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
    1992 |    2962     23.2408    .1826822    9.942341     22.8826    23.59899
    2012 |    3955    23.42605    .1790882    11.26264    23.07494    23.77717
---------+--------------------------------------------------------------------
combined |    6917    23.34672    .1288569    10.71684    23.09412    23.59932
---------+--------------------------------------------------------------------
    diff |            -.185257    .2604205               -.6957612    .3252471
------------------------------------------------------------------------------
    diff = mean(1992) - mean(2012)                                t =  -0.7114
Ho: diff = 0                                     degrees of freedom =     6915

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2384         Pr(|T| > |t|) = 0.4769          Pr(T > t) = 0.7616

. ttest ahe if bachelor==0, by(year)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
    1992 |    4650    16.31645    .1105541    7.538785    16.09971    16.53319
    2012 |    3485    15.68547    .1397007    8.247077    15.41157    15.95938
---------+--------------------------------------------------------------------
combined |    8135    16.04614    .0870982    7.855756    15.87541    16.21688
---------+--------------------------------------------------------------------
    diff |            .6309786    .1758823                .2862043     .975753
------------------------------------------------------------------------------
    diff = mean(1992) - mean(2012)                                t =   3.5875
Ho: diff = 0                                     degrees of freedom =     8133

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.9998         Pr(|T| > |t|) = 0.0003          Pr(T > t) = 0.0002

. by female: sum ahe if year==2012 & bachelor==0
not sorted
r(5);

. sort female

. by female: sum ahe if year==2012 & bachelor==0

----------------------------------------------------------------------------------------------------------------------------------------------------
-> female = 0

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      2279    17.04357    8.900968   2.136752   91.45602

----------------------------------------------------------------------------------------------------------------------------------------------------
-> female = 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      1206    13.11905    6.065704   2.277328   53.84615


. by female: sum ahe if year==2012 & bachelor==1

----------------------------------------------------------------------------------------------------------------------------------------------------
-> female = 0

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      2004    25.29886    12.09112   2.136752   76.92308

----------------------------------------------------------------------------------------------------------------------------------------------------
-> female = 1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         ahe |      1951    21.50238    9.986548   2.163461   72.11539


. 
